Revit 2027 API
FamilyParameter.AssociatedParameters Property
The parameters from elements in the family which are associated to this parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ParameterSet AssociatedParameters { get; }
Public ReadOnly Property AssociatedParameters As ParameterSet
	Get
public:
property ParameterSet^ AssociatedParameters {
	ParameterSet^ get ();
}
member AssociatedParameters : ParameterSet with get
Property Value
ParameterSet
See Also
Reference
FamilyParameter Class
Autodesk.Revit.DB Namespace